In [1]:
import pandas as pd
import numpy as np

In [2]:
file = 'new_2014_mls.csv'

In [3]:
df = pd.read_csv(file, encoding = "ISO-8859-1")

In [4]:
df.dtypes

Unnamed: 0           int64
Zip                  int64
Sqft Total          object
List Price          object
Sold/Lease$/SqFt    object
Sold/Lease Price    object
Sold/Lease Date     object
dtype: object

In [6]:
df.tail()

,Unnamed: 0,Zip,Sqft Total,List Price,Sold/Lease$/SqFt,Sold/Lease Price,Sold/Lease Date
11087,11087,78735,"5,728","$1,850,000",$303.95,"$1,741,000",4/1/2014
11088,11088,78735,"4,314","$1,749,000",$405.42,"$1,749,000",9/19/2014
11089,11089,78735,"5,515","$1,850,000",$326.38,"$1,800,000",11/21/2014
11090,11090,78735,"5,300","$2,000,000",$452.83,"$2,399,999",3/18/2014
11091,11091,78736,"8,831","$2,595,000",$283.09,"$2,500,000",2/11/2014

In [7]:
# Using .rename(columns={}) in order to rename columns
renamed_df = df.rename(columns={"Zip":"Zip Code", "Sqft Total":"Square Footage", "Sold/Lease$/SqFt":"Sold Price Per Foot","Sold/Lease Date":"Sold Date","Sold/Lease Price":"Sold Price"})
del renamed_df['Unnamed: 0']
# renamed_df = renamed_df.drop(renamed_df.index[-1])
renamed_df = renamed_df.fillna(0)

In [8]:
for idx, row in renamed_df.iterrows():
    renamed_df.set_value(idx,'Sold Price', float(str(row['Sold Price']).replace(',','').replace('$','').strip()))
    renamed_df.set_value(idx,'Zip Code', float(str(row['Zip Code']).replace(',','').replace('$','').strip()))
    renamed_df.set_value(idx, 'Square Footage', float(str(row['Square Footage']).replace(',','').replace('$','').strip()))
    renamed_df.set_value(idx,'List Price', float(str(row['List Price']).replace(',','').replace('$','').strip()))
    renamed_df.set_value(idx,'Sold Price Per Foot', float(str(row['Sold Price Per Foot']).replace(',','').replace('$','').strip()))

renamed_df.tail()

,Zip Code,Square Footage,List Price,Sold Price Per Foot,Sold Price,Sold Date
11087,78735,5728,1.85e+06,303.95,1.741e+06,4/1/2014
11088,78735,4314,1.749e+06,405.42,1.749e+06,9/19/2014
11089,78735,5515,1.85e+06,326.38,1.8e+06,11/21/2014
11090,78735,5300,2e+06,452.83,2.4e+06,3/18/2014
11091,78736,8831,2.595e+06,283.09,2.5e+06,2/11/2014

In [9]:
renamed_df.dtypes

Zip Code                int64
Square Footage         object
List Price             object
Sold Price Per Foot    object
Sold Price             object
Sold Date              object
dtype: object

In [10]:
renamed_df['Sold Price'] = renamed_df['Sold Price'].astype(int)
renamed_df['Zip Code'] = renamed_df['Zip Code'].astype(int)
renamed_df['Square Footage'] = renamed_df['Square Footage'].astype(int)
renamed_df['Sold Price Per Foot'] = renamed_df['Sold Price Per Foot'].astype(float)
renamed_df['List Price'] = renamed_df['List Price'].astype(int)

In [11]:
renamed_df.dtypes

Zip Code                 int32
Square Footage           int32
List Price               int32
Sold Price Per Foot    float64
Sold Price               int32
Sold Date               object
dtype: object

In [12]:
renamed_df.describe()

,Zip Code,Square Footage,List Price,Sold Price Per Foot,Sold Price
count,11092.000000,11092.000000,1.109200e+04,11092.000000,1.109200e+04
mean,78737.376578,2244.248648,4.104757e+05,178.583589,4.023666e+05
std,106.581108,1065.192438,3.690929e+05,85.593937,3.462971e+05
min,78617.000000,360.000000,3.450000e+04,15.850000,2.666000e+04
25%,78727.000000,1495.000000,2.250000e+05,124.555000,2.230000e+05
50%,78738.000000,2020.000000,3.165000e+05,151.275000,3.150000e+05
75%,78748.000000,2762.500000,4.664260e+05,208.895000,4.598542e+05
max,89838.000000,14425.000000,7.250000e+06,1245.390000,6.750000e+06

In [13]:
renamed_df.head()

,Zip Code,Square Footage,List Price,Sold Price Per Foot,Sold Price,Sold Date
0,78759,1741,369000,186.67,325000,8/18/2014
1,78759,2058,399000,168.61,347000,9/11/2014
2,78731,1662,374900,215.40,358000,10/31/2014
3,78731,1997,410000,185.03,369500,9/15/2014
4,78731,2058,390000,187.07,385000,6/6/2014

In [15]:
new_2013_df = renamed_df
new_2013_df.to_csv("clean_2014_mls.csv")